//напишите программу которая на вход принимает число и выдаёт  его квадрат 

Console.Write("Введите Число ->");
int num = int.Parse(Console.ReadLine());
int numResult = num * num;
Console.Write("Квадрат числа равен ->");
Console.WriteLine(numResult);