// Напишите программу которая принимает на ввод  трёхзначное число
// и на выходе показывает последнее цифру

Console.WriteLine("Hello, World!");
